tutorials/incompressibleVoF/parshallFlume/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Geometry (ISO 9826:1992,  Table 1 - Standard Flume Number 13)
vertices
(
    (0 -2.5 0)
    (4 -2.5 0)
    (5.64 -1.68 0.072)
    (8.04 -1.2 0.072)
    (8.64 -1.2 -0.158)
    (9.56 -1.35 0)
    (11.86 -2.5 0)
    (15.86 -2.5 0)

    (0 -2.5 2)
    (4 -2.5 2)
    (5.64 -1.68 2)
    (8.04 -1.2 2)
    (8.64 -1.2 2)
    (9.56 -1.35 2)
    (11.86 -2.5 2)
    (15.86 -2.5 2)

    (0   2.5 0)
    (4 2.5 0)
    (5.64 1.68 0.072)
    (8.04 1.2  0.072)
    (8.64 1.2  -0.158)
    (9.56 1.35 0)
    (11.86 2.5 0)
    (15.86 2.5 0)

    (0   2.5 2)
    (4 2.5 2)
    (5.64 1.68 2)
    (8.04 1.2  2)
    (8.64 1.2  2)
    (9.56 1.35 2)
    (11.86 2.5 2)
    (15.86 2.5 2)
);

blocks
(
    hex (0 1 17 16 8 9 25 24) (15 14 25) simpleGrading (1 1 20)
    hex (1 2 18 17 9 10 26 25) (7 14 25) simpleGrading (1 1 20)
    hex (2 3 19 18 10 11 27 26) (14 14 25) simpleGrading (0.45 1 20)
    hex (3 4 20 19 11 12 28 27) (6 14 25) simpleGrading (1 1 20)
    hex (4 5 21 20 12 13 29 28) (10 14 25) simpleGrading (1 1 20)
    hex (5 6 22 21 13 14 30 29) (20 14 25) simpleGrading (2 1 20)
    hex (6 7 23 22 14 15 31 30) (25 14 25) simpleGrading (1 1 20)
);

defaultPatch
{
    name walls;
    type wall;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 24 16)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (7 15 31 23)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (8 9 25 24)
            (9 10 26 25)
            (10 11 27 26)
            (11 12 28 27)
            (12 13 29 28)
            (13 14 30 29)
            (14 15 31 30)
        );
    }
);

// ************************************************************************* //
